app/views/pics/_find_photos.html.erb

					<a href = "/pics/user/<%=myPic.user.id%>/#<%=myPic.id%>"><img class = "search" src="/images/<%=myPic.file_name%>" alt = "<%=myPic.file_name%>"/></a>
					<p><%=myPic.user.first_name%>  <%=myPic.user.last_name%>, photo_id: <%=myPic.id%><p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1