app/views/pics/user.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 16 LIMIT 1
---
						 <%if(tag.user_id != photo.user_id)%>
						 		 <%=tag.user.first_name%> <%=tag.user.last_name%> |

SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = 22
SELECT COUNT(*) FROM "comments" WHERE "comments"."photo_id" = 22
---
		    <td class = "element">
				<%if(photo.comments.size() !=0)%>