app/controllers/pics_controller.rb

SELECT "users".* FROM "users"
---
  def users
	@users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "15"]]
SELECT "users".* FROM "users"
SELECT "photos".* FROM "photos"
SELECT "comments".* FROM "comments"
SELECT "tags".* FROM "tags"
---
  def user
	@user = User.find(params[:id])
	@users = User.all
	@photos = Photo.all
	@comments = Comment.all
	@tags = Tag.all

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "18"]]
---
  def comment
    @photo = Photo.find(params[:id])

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "18"]]
INSERT INTO "comments" ("comment", "created_at", "date_time", "photo_id", "pics_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def post_comment
    @photo = Photo.find(params[:id])
    @comment = Comment.new(params[:thisComment])
    if (@comment.save)

SELECT "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT 1  [["id", "26"]]
INSERT INTO "tags" ("created_at", "height", "photo_id", "tagger_id", "updated_at", "user_id", "width", "x_coord", "y_coord") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def post_tag
      puts params[:tag]
      @tag = Tag.new(params[:tag])
      @thephoto = Photo.find(params[:tag][:photo_id])
      if (@tag.save)