app/controllers/user_controller.rb

  def post_login
       if User.where(login: params[:User][:login]).size > 0
---
SELECT "users".* FROM "users" WHERE "users"."login" = 'verma' LIMIT 1
SELECT COUNT(*) FROM "users" WHERE "users"."login" = 'ouster'

  def post_register
      @user = User.new(params[:user])
      if (@user.save)
---
INSERT INTO "users" ("created_at", "first_name", "last_name", "login", "password_digest", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)